LuweiLiao/ardu-rtthread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_spi.c
    if (HAL_SPI_Init(spi_handle) != HAL_OK)
    {
        return -RT_EIO;
    }

#if defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32F0) \
        || defined(SOC_SERIES_STM32F7) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32WB)
    SET_BIT(spi_handle->Instance->CR2, SPI_RXFIFO_THRESHOLD_HF);
#endif

    /* DMA configuration */
    if (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG)
    {
        HAL_DMA_Init(&spi_drv->dma.handle_rx);

        __HAL_LINKDMA(&spi_drv->handle, hdmarx, spi_drv->dma.handle_rx);

        /* NVIC configuration for DMA transfer complete interrupt
         * Priority 5: below RT-Thread kernel critical section threshold,
         * same group as TX to prevent DMA RX/TX nesting each other */
        HAL_NVIC_SetPriority(spi_drv->config->dma_rx->dma_irq, 5, 0);
        HAL_NVIC_EnableIRQ(spi_drv->config->dma_rx->dma_irq);
    }

    if (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG)
    {
        HAL_DMA_Init(&spi_drv->dma.handle_tx);

        __HAL_LINKDMA(&spi_drv->handle, hdmatx, spi_drv->dma.handle_tx);

        /* NVIC configuration for DMA transfer complete interrupt
         * Priority 5: same group as RX to prevent nesting */
        HAL_NVIC_SetPriority(spi_drv->config->dma_tx->dma_irq, 5, 1);
        HAL_NVIC_EnableIRQ(spi_drv->config->dma_tx->dma_irq);
    }

    if(spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG || spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG)
    {
        HAL_NVIC_SetPriority(spi_drv->config->irq_type, 5, 2);
        HAL_NVIC_EnableIRQ(spi_drv->config->irq_type);
    }

    LOG_D("%s init done", spi_drv->config->bus_name);
    return RT_EOK;
}

static rt_ssize_t spixfer(struct rt_spi_device *device, struct rt_spi_message *message)
{
    /*
     * Keep DMA threshold conservative to avoid setup-stage stalls while still
     * reducing polling overhead on medium/large transfers.
     */
    /*
     * STM32F7 short polling transfers can wedge inside the HAL SPI
     * transmit/receive loops. Prefer DMA for all transfer sizes so we
     * stay on the LLD/HAL-DMA paths instead of falling back to polling.
     */
    #define DMA_TRANS_MIN_LEN  1

    HAL_StatusTypeDef state = HAL_OK;
    rt_size_t message_length, already_send_length;
    rt_uint16_t send_length;
    rt_uint8_t *recv_buf;
    const rt_uint8_t *send_buf;

    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(device->bus != RT_NULL);
    RT_ASSERT(message != RT_NULL);

    struct stm32_spi *spi_drv =  rt_container_of(device->bus, struct stm32_spi, spi_bus);
    SPI_HandleTypeDef *spi_handle = &spi_drv->handle;

    if (message->cs_take && !(device->config.mode & RT_SPI_NO_CS) && (device->cs_pin != PIN_NONE))
    {
        if (device->config.mode & RT_SPI_CS_HIGH)
        {
            rt_pin_write(device->cs_pin, PIN_HIGH);
        }
        else
        {
            rt_pin_write(device->cs_pin, PIN_LOW);
        }
    }

    LOG_D("%s transfer prepare and start", spi_drv->config->bus_name);
    LOG_D("%s sendbuf: %X, recvbuf: %X, length: %d",
          spi_drv->config->bus_name,
          (uint32_t)message->send_buf,
          (uint32_t)message->recv_buf, message->length);

    message_length = message->length;
    recv_buf = message->recv_buf;
    send_buf = message->send_buf;
    while (message_length)
    {
        /* the HAL library use uint16 to save the data length */
        if (message_length > 65535)
        {
            send_length = 65535;
            message_length = message_length - 65535;
        }
        else
        {
            send_length = message_length;
            message_length = 0;
        }

        /* calculate the start address */
        already_send_length = message->length - send_length - message_length;
        /* avoid null pointer problems */
        if (message->send_buf)
        {
            send_buf = (rt_uint8_t *)message->send_buf + already_send_length;
        }
        if (message->recv_buf)
        {
            recv_buf = (rt_uint8_t *)message->recv_buf + already_send_length;
        }

        rt_uint32_t* dma_aligned_buffer = RT_NULL;
        rt_uint32_t* p_txrx_buffer = RT_NULL;

        if ((spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG) && (send_length >= DMA_TRANS_MIN_LEN)
            && message->send_buf != RT_NULL)
        {
#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F7)
            if (RT_IS_ALIGN((rt_uint32_t)send_buf, 32) && send_buf != RT_NULL) /* aligned with 32 bytes? */
            {
                p_txrx_buffer = (rt_uint32_t *)send_buf;
            }
            else
            {
                dma_aligned_buffer = (rt_uint32_t *)rt_malloc_align(send_length, 32);
                if (dma_aligned_buffer == RT_NULL)
                {
                    /* malloc failed: fall back to direct pointer (best effort) */
                    p_txrx_buffer = (rt_uint32_t *)send_buf;
                }
                else
                {
                    rt_memcpy(dma_aligned_buffer, send_buf, send_length);
                    p_txrx_buffer = dma_aligned_buffer;
                }
            }
            if (p_txrx_buffer != RT_NULL)
            {
                rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, p_txrx_buffer, send_length);
            }
#else
            if (RT_IS_ALIGN((rt_uint32_t)send_buf, 4) && send_buf != RT_NULL) /* aligned with 4 bytes? */
            {
                p_txrx_buffer = (rt_uint32_t *)send_buf; /* send_buf aligns with 4 bytes, no more operations */
            }
            else
            {
                /* send_buf doesn't align with 4 bytes, so creat a cache buffer with 4 bytes aligned */
                dma_aligned_buffer = (rt_uint32_t *)rt_malloc(send_length); /* aligned with RT_ALIGN_SIZE (8 bytes by default) */
                if (dma_aligned_buffer != RT_NULL)
                {
                    rt_memcpy(dma_aligned_buffer, send_buf, send_length);
                    p_txrx_buffer = dma_aligned_buffer;
                }
                else
                {
                    p_txrx_buffer = (rt_uint32_t *)send_buf;
                }
            }
#endif /* SOC_SERIES_STM32H7 || SOC_SERIES_STM32F7 */
        }
        else if ((spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG) && (send_length >= DMA_TRANS_MIN_LEN)
                 && message->recv_buf != RT_NULL && message->send_buf == RT_NULL)
        {
#if defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32F7)
            if (RT_IS_ALIGN((rt_uint32_t)recv_buf, 32) && recv_buf != RT_NULL) /* aligned with 32 bytes? */
            {
                p_txrx_buffer = (rt_uint32_t *)recv_buf;
            }
            else
            {
                dma_aligned_buffer = (rt_uint32_t *)rt_malloc_align(send_length, 32);
                if (dma_aligned_buffer == RT_NULL)
                {
                    p_txrx_buffer = (rt_uint32_t *)recv_buf;
                }
                else
                {
                    rt_memcpy(dma_aligned_buffer, recv_buf, send_length);
                    p_txrx_buffer = dma_aligned_buffer;
                }
            }
            if (p_txrx_buffer != RT_NULL)
            {
                rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, p_txrx_buffer, send_length);
            }
#else
            if (RT_IS_ALIGN((rt_uint32_t)recv_buf, 4) && recv_buf != RT_NULL) /* aligned with 4 bytes? */
            {
                p_txrx_buffer = (rt_uint32_t *)recv_buf; /* recv_buf aligns with 4 bytes, no more operations */
            }
            else
            {
                /* recv_buf doesn't align with 4 bytes, so creat a cache buffer with 4 bytes aligned */
                dma_aligned_buffer = (rt_uint32_t *)rt_malloc(send_length); /* aligned with RT_ALIGN_SIZE (8 bytes by default) */
                rt_memcpy(dma_aligned_buffer, recv_buf, send_length);
                p_txrx_buffer = dma_aligned_buffer;
            }
#endif /* SOC_SERIES_STM32H7 || SOC_SERIES_STM32F7 */
        }

        /* start once data exchange in DMA mode */
        if (message->send_buf && message->recv_buf)
        {
            if ((spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG) && (spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG) && (send_length >= DMA_TRANS_MIN_LEN))
            {
#if defined(SOC_SERIES_STM32F7)
                /* LLD path: no busy-wait in ISR */
                if (spi_drv->lld != RT_NULL)
                {
                    state = (spi_lld_xfer(spi_drv->lld,
                                          (const uint8_t *)p_txrx_buffer,
                                          (uint8_t *)p_txrx_buffer,
                                          send_length) == RT_EOK) ? HAL_OK : HAL_ERROR;
                }
                else
#endif
                {
                    state = HAL_SPI_TransmitReceive_DMA(spi_handle, (uint8_t *)p_txrx_buffer, (uint8_t *)p_txrx_buffer, send_length);
                }
            }
            else if ((spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG) && (send_length >= DMA_TRANS_MIN_LEN))
            {
                /* same as Tx ONLY. It will not receive SPI data any more. */
                state = HAL_SPI_Transmit_DMA(spi_handle, (uint8_t *)p_txrx_buffer, send_length);
            }
            else if ((spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG) && (send_length >= DMA_TRANS_MIN_LEN))
            {
                state = HAL_ERROR;
                LOG_E("It shoule be enabled both BSP_SPIx_TX_USING_DMA and BSP_SPIx_TX_USING_DMA flag, if wants to use SPI DMA Rx singly.");
                break;
            }
            else
            {
                state = HAL_SPI_TransmitReceive(spi_handle, (uint8_t *)send_buf, (uint8_t *)recv_buf, send_length, 1000);
            }
        }
        else if (message->send_buf)
        {
            if ((spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG) && (send_length >= DMA_TRANS_MIN_LEN))
            {
                state = HAL_SPI_Transmit_DMA(spi_handle, (uint8_t *)p_txrx_buffer, send_length);
            }
            else
            {
                state = HAL_SPI_Transmit(spi_handle, (uint8_t *)send_buf, send_length, 1000);
            }

            if (message->cs_release && (device->config.mode & RT_SPI_3WIRE))
            {
                /* release the CS by disable SPI when using 3 wires SPI */
                __HAL_SPI_DISABLE(spi_handle);
            }
        }
        else if(message->recv_buf)
        {
            rt_memset((uint8_t *)recv_buf, 0xff, send_length);
            if ((spi_drv->spi_dma_flag & SPI_USING_RX_DMA_FLAG) && (send_length >= DMA_TRANS_MIN_LEN))
            {
#if defined(SOC_SERIES_STM32F7)
                /* LLD path: for RX-only, use full-duplex LLD with dummy TX
                 * (recv_buf is pre-filled with 0xFF which serves as dummy TX). */
                if (spi_drv->lld != RT_NULL &&
                    (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG))
                {
                    state = (spi_lld_xfer(spi_drv->lld,
                                          (const uint8_t *)p_txrx_buffer,
                                          (uint8_t *)p_txrx_buffer,
                                          send_length) == RT_EOK) ? HAL_OK : HAL_ERROR;
                }
                else
#endif
                if (spi_drv->spi_dma_flag & SPI_USING_TX_DMA_FLAG)
                {
                    /*
                     * STM32F7 workaround: HAL_SPI_Receive_DMA hangs in
                     * SPI_EndRxTransaction BSY wait. Use TransmitReceive_DMA
                     * with dummy TX (0xFF already in recv_buf) to avoid BSY hang.
                     */
                    state = HAL_SPI_TransmitReceive_DMA(spi_handle,
                                                        (uint8_t *)p_txrx_buffer,
                                                        (uint8_t *)p_txrx_buffer,
                                                        send_length);
                }
                else
                {
                    state = HAL_SPI_Receive_DMA(spi_handle, (uint8_t *)p_txrx_buffer, send_length);
                }
            }
            else
            {
                /* clear the old error flag */
                __HAL_SPI_CLEAR_OVRFLAG(spi_handle);
                state = HAL_SPI_Receive(spi_handle, (uint8_t *)recv_buf, send_length, 1000);
            }
        }
        else
        {
            state = HAL_ERROR;
            LOG_E("message->send_buf and message->recv_buf are both NULL!");
        }

